{
  "backend/main.mo": "Main Motoko actor for the FarmSmart backend, implementing user profile management, soil image analysis, crop advisory, and marketplace product/crop listing functionality with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dashboard layout fixes, quick links, payment flow) to their associated source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of key frontend source files including SoilAnalysis, MyCropListings, SellerProductManagement, and useQueries hook pages.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the FarmSmart React SPA, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (dashboard, soil analysis, marketplace, checkout, etc.), wraps the app in QueryClient and ThemeProvider, and renders the shared Header/Footer layout.",
  "frontend/src/components/layout/Footer.tsx": "Site footer component rendering the FarmSmart brand, a Quick Links column, and a Farmer Tools column with icon-accompanied navigation buttons linking to all major app routes.",
  "frontend/src/components/layout/Header.tsx": "Sticky top navigation header with desktop nav links, mobile sheet menu, and a user dropdown for authentication (login/logout) using Internet Identity. Displays active route highlighting and user profile name.",
  "frontend/src/components/layout/Layout.tsx": "Simple layout wrapper that composes Header, main content area, and Footer into a full-height flex column.",
  "frontend/src/components/PaymentFormDialog.tsx": "Modal dialog component that collects and validates payment details (cardholder name, card number, expiry, CVV), submits a simulated checkout via the useCheckout mutation, and calls an onSuccess callback with the resulting order.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing login, logout, identity, and login status to the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks (queries and mutations) for all backend operations including user profile, soil analysis, crop advisory, marketplace products, store items, crop listings, and orders.",
  "frontend/src/index.css": "Global stylesheet importing Nunito/Merriweather fonts, Tailwind directives, and defining an earthy-green/amber OKLCH design token palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AuthPage.tsx": "Authentication page that handles Internet Identity login and, for new users, collects a username and location to create their profile before redirecting to the dashboard.",
  "frontend/src/pages/BuyFromFarmers.tsx": "Page that displays crop listings filtered by the user's location with a search bar, and allows purchasing a listing via a PaymentFormDialog that redirects to checkout success on completion.",
  "frontend/src/pages/CheckoutSuccess.tsx": "Order confirmation page that reads confirmation number and total from URL search params, displays order details with an estimated delivery window, and provides navigation buttons to order history or home.",
  "frontend/src/pages/CropAdvisory.tsx": "Form page where users enter soil parameters (type, pH, moisture, region) to request AI-generated smart crop advisory recommendations, with validation and loading skeleton states.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing a hero section with a personalized greeting, a grid of feature cards linking to all major app sections, and a quick-access navigation bar.",
  "frontend/src/pages/Marketplace.tsx": "Page listing farming products from local sellers filtered by the user's location and a search input, with a PaymentFormDialog for immediate purchase and redirect to checkout success.",
  "frontend/src/pages/MyCropListings.tsx": "Page for authenticated farmers to view and manage their own crop listings, with a dialog form to add new listings including crop name, quantity, price, and location.",
  "frontend/src/pages/OrderHistory.tsx": "Page that displays a logged-in user's past orders fetched via useGetOrders, showing order details with loading skeletons and empty-state navigation to the store or marketplace.",
  "frontend/src/pages/OurStore.tsx": "Store page that lists available farming supply items, supports a shopping cart with quantity controls, and opens a payment dialog that redirects to a checkout success page on completion.",
  "frontend/src/pages/SellCrops.tsx": "Landing page for authenticated farmers to choose how to sell crops, displaying platform stats and navigation cards linking to crop listings and other selling options.",
  "frontend/src/pages/SellerProductManagement.tsx": "Page for authenticated sellers to view and manage their own product listings (fertilizers, seeds, tools), with a dialog form to add new products including name, description, price, and location.",
  "frontend/src/pages/SoilAnalysis.tsx": "React page component for soil image analysis that allows farmers to upload or capture a soil photo, sends it to the backend via a mutation hook, and displays crop recommendations and care tips from the analysis result.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to extract URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom fonts (Nunito, Merriweather), an extended color palette including farm-themed greens and ambers, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 5) describing the FarmSmart app's existing features, architectural notes, known issues, and overall summary of a farmer-focused platform with soil analysis, crop advisory, marketplace, and payment integration."
}